Revit 2026 API

# FilteredWorksetCollectorGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<Workset> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of Workset)
```
```cpp
public:
virtual IEnumerator<Workset^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<Workset>
override GetEnumerator : unit -> IEnumerator<Workset>
```

#### Return Value

IEnumeratorWorksetAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

FilteredWorksetCollector Class

Autodesk.Revit.DB Namespace